import os #імпорутємо модуль для роботи з операційною системою

def find_paragraph(file_path, word): #Створюємо функцію find_paragraph яка приймає в якості параметрів аргументів директорію файла та слова яке потрібно буде знайти
    if os.path.exists(file_path): # Перевіряємо чи існує назва папки за введеною директорією
        with open(file_path, 'r') as file: # Використовуємо синтакси with/as для зчитування файла 
            paragraphs = file.read().split('\n\n') # Створюємо масив у якому кожен елемент цього масива буде абзацом (абзац буде записаний в стрічку а між розривами стрічок буде записане '\n')
            for paragraph in paragraphs: # Ітеруємо по кожному абзацу цього масива 
                 if word.lower() in paragraph.lower(): # Якщо введене слово буде у якомусь елементі масива то він виведеться
                    print(paragraph)                   
    else:
        print(f"Файл '{file_path}' не знайдено.") # Якщо файл не знайдено за директорією то виведеться це повідомлення

file_path = input("Введіть назву файлу: ") # Вводимо директорію файла
word = input("Введіть слово: ") # Вводимо слово за яким у нас пошук

find_paragraph(file_path, word) # Викликаємо функцію find_paragraph
